
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>I. はじめに · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="styles/website.css">
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter02.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    地学ライブラリツール 操作マニュアル
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.1.1" data-path="chapter01.html">
            
                <a href="chapter01.html">
            
                    
                    I. はじめに
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.2" data-path="chapter02.html">
            
                <a href="chapter02.html">
            
                    
                    II. 地学ライブラリツールプラグインの導入・設定
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.3" data-path="chapter03.html">
            
                <a href="chapter03.html">
            
                    
                    III. オプションの設定
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.4" data-path="chapter04.html">
            
                <a href="chapter04.html">
            
                    
                    IV. 地学ライブラリツールの機能
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >I. はじめに</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x2170;-&#x306F;&#x3058;&#x3081;&#x306B;">&#x2160;. &#x306F;&#x3058;&#x3081;&#x306B;</h1>
<h2 id="&#x5730;&#x5B66;&#x30E9;&#x30A4;&#x30D6;&#x30E9;&#x30EA;&#x30C4;&#x30FC;&#x30EB;&#x30D7;&#x30E9;&#x30B0;&#x30A4;&#x30F3;&#x306B;&#x3064;&#x3044;&#x3066;">&#x5730;&#x5B66;&#x30E9;&#x30A4;&#x30D6;&#x30E9;&#x30EA;&#x30C4;&#x30FC;&#x30EB;&#x30D7;&#x30E9;&#x30B0;&#x30A4;&#x30F3;&#x306B;&#x3064;&#x3044;&#x3066;</h2>
<p>QGIS &#x306F;&#x30AA;&#x30FC;&#x30D7;&#x30F3;&#x30BD;&#x30FC;&#x30B9;&#x306E;&#x5730;&#x7406;&#x60C5;&#x5831;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x3001;&#x30C7;&#x30B9;&#x30AF;&#x30C8;&#x30C3;&#x30D7;&#x4E0A;&#x3067;&#x5730;&#x7406;&#x60C5;&#x5831;&#x306E;&#x4F5C;&#x6210;&#x30FB;&#x7DE8;&#x96C6;&#x30FB;&#x8868;&#x793A;&#x3092;&#x884C;&#x3046;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;QGIS&#x306E;&#x958B;&#x767A;&#x306F;2002&#x5E74;5&#x6708;&#x306B;&#x958B;&#x59CB;&#x3055;&#x308C;&#x3001;&#x73FE;&#x5728;&#xFF08;2019&#x5E74;4&#x6708;&#xFF09;&#x3067;&#x306F; Version3.6 &#x304C;&#x30EA;&#x30EA;&#x30FC;&#x30B9;&#x3055;&#x308C;&#x3066;&#x304A;&#x308A;&#x3001;Unix&#x3001;Windows&#x3001;OS X&#x3067;&#x52D5;&#x4F5C;&#x3057;&#x307E;&#x3059;&#x3002;<br>QGIS&#x306F;&#x6C4E;&#x7528;&#x7684;&#x306A;GIS&#x30BD;&#x30D5;&#x30C8;&#x306E;&#x305F;&#x3081;&#x591A;&#x304F;&#x306E;&#x6A5F;&#x80FD;&#x3092;&#x6301;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x304C;&#x3001;&#x305D;&#x306E;&#x6A5F;&#x80FD;&#x3092;&#x4F7F;&#x3044;&#x3053;&#x306A;&#x3059;&#x306B;&#x306F;GIS&#x306E;&#x5C02;&#x9580;&#x7528;&#x8A9E;&#x3092;&#x7406;&#x89E3;&#x3057;&#x305F;&#x308A;&#x64CD;&#x4F5C;&#x306B;&#x6163;&#x308C;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x305D;&#x306E;&#x305F;&#x3081;&#x3001;GIS&#x306E;&#x5C02;&#x9580;&#x6280;&#x8853;&#x8005;&#x3067;&#x306A;&#x3044;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x306B;&#x3068;&#x3063;&#x3066;&#x306F;&#x3001;&#x76EE;&#x7684;&#x306E;&#x5730;&#x56F3;&#x3092;&#x4F5C;&#x6210;&#x3059;&#x308B;&#x306E;&#x306F;&#x56F0;&#x96E3;&#x3067;&#x3059;&#x3002;</p>
<p>&#x672C;&#x30D7;&#x30E9;&#x30B0;&#x30A4;&#x30F3;&#x306F;&#x3001;&#x5730;&#x8CEA;&#x56F3;&#x5B66;&#x306E;&#x57FA;&#x790E;&#x77E5;&#x8B58;&#x304C;&#x3042;&#x308C;&#x3070;&#x3001;GIS&#x306E;&#x64CD;&#x4F5C;&#x306B;&#x3042;&#x307E;&#x308A;&#x8A73;&#x3057;&#x304F;&#x306A;&#x3044;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x3067;&#x3082;QGIS&#x4E0A;&#x3067;&#x5730;&#x5B66;&#x6559;&#x6750;&#x306E;&#x4F5C;&#x6210;&#x3084;&#x30EB;&#x30FC;&#x30C8;&#x30DE;&#x30C3;&#x30D7;&#x304B;&#x3089;&#x5730;&#x8CEA;&#x56F3;&#x306E;&#x4F5C;&#x6210;&#x304C;&#x884C;&#x3048;&#x308B;&#x3088;&#x3046;&#x306B;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306A;&#x5730;&#x5B66;&#x6559;&#x6750;&#x5730;&#x56F3;&#x4F5C;&#x6210;&#x306B;&#x7279;&#x5316;&#x3057;&#x305F;&#x6A5F;&#x80FD;&#x3092;&#x642D;&#x8F09;&#x3057;&#x305F;&#x3001;&#x5730;&#x5B66;&#x6559;&#x6750;&#x7528;&#x5730;&#x56F3;&#x8CC7;&#x6599;&#x4F5C;&#x6210;&#x306E;&#x305F;&#x3081;&#x306E;&#x30A2;&#x30C9;&#x30AA;&#x30F3;&#x3057;&#x305F;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3067;&#x3059;&#x3002;</p>
<blockquote>
<p>&#x672C;&#x30A2;&#x30C9;&#x30AA;&#x30F3;&#xFF08;Geolib3 Ver.1.0.1&#xFF09;&#x306F;&#x3001;QGIS&#x306E; Version3.0 &#x4EE5;&#x4E0A;&#x306B;&#x5BFE;&#x5FDC;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;QGIS 2.x&#x7CFB;&#x3067;&#x306F;&#x6B63;&#x5E38;&#x306B;&#x52D5;&#x4F5C;&#x3057;&#x307E;&#x305B;&#x3093;&#x3002;
&#x307E;&#x305F;&#x3001;&#x672C;&#x30A2;&#x30C9;&#x30AA;&#x30F3;&#x306F;&#x82F1;&#x8A9E;&#x3068;&#x65E5;&#x672C;&#x8A9E;&#x306E;&#x8A00;&#x8A9E;&#x306B;&#x5BFE;&#x5FDC;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x304C;&#x3001;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x7B49;&#x306F;&#x4E00;&#x90E8;&#x82F1;&#x8A9E;&#x306E;&#x307F;&#x3068;&#x306A;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;<br>&#x306A;&#x304A;&#x3001;Geolib3&#x5BFE;&#x5FDC;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x3067;&#x306F;&#x3001;&#x30EC;&#x30A4;&#x30E4;&#x306E;&#x4FDD;&#x5B58;&#x5F62;&#x5F0F;&#x304C;geoPackage&#x5F62;&#x5F0F;&#x3068;&#x306A;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;<br>&#x305D;&#x306E;&#x305F;&#x3081;&#x3001;&#x65E7;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x3067;&#x4F5C;&#x6210;&#x3057;&#x305F;&#x30EC;&#x30A4;&#x30E4;&#x30FC;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#xFF08;shape&#x5F62;&#x5F0F;&#x304A;&#x3088;&#x3073;GeoJSON&#x5F62;&#x5F0F;&#xFF09;&#x3092;&#x672C;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x3067;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001;&#x65E7;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x304B;&#x3089;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x79FB;&#x884C;&#x3059;&#x308B;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;<br>&#x3053;&#x306E;&#x30C7;&#x30FC;&#x30BF;&#x306E;&#x79FB;&#x884C;&#x65B9;&#x6CD5;&#x306B;&#x3064;&#x3044;&#x3066;&#x306F;&#x3001;&#x30DE;&#x30CB;&#x30E5;&#x30A2;&#x30EB;&#x5185;&#x306B;&#x8A18;&#x8F09;&#x3057;&#x307E;&#x3059;&#x3002;</p>
</blockquote>
<h2 id="&#x5730;&#x5B66;&#x30E9;&#x30A4;&#x30D6;&#x30E9;&#x30EA;&#x30C4;&#x30FC;&#x30EB;&#x30D7;&#x30E9;&#x30B0;&#x30A4;&#x30F3;&#x3067;&#x3067;&#x304D;&#x308B;&#x3053;&#x3068;">&#x5730;&#x5B66;&#x30E9;&#x30A4;&#x30D6;&#x30E9;&#x30EA;&#x30C4;&#x30FC;&#x30EB;&#x30D7;&#x30E9;&#x30B0;&#x30A4;&#x30F3;&#x3067;&#x3067;&#x304D;&#x308B;&#x3053;&#x3068;</h2>
<p>&#x672C;&#x30D7;&#x30E9;&#x30B0;&#x30A4;&#x30F3;&#x3067;&#x306F;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306A;&#x3053;&#x3068;&#x304C;&#x884C;&#x3048;&#x307E;&#x3059;&#x3002;  </p>
<ul>
<li>&#x5730;&#x5B66;&#x30E9;&#x30A4;&#x30D6;&#x30E9;&#x30EA;&#x7528;&#x5730;&#x56F3;&#x3092;&#x4F5C;&#x6210;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x5FC5;&#x8981;&#x306A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x30BB;&#x30C3;&#x30C8;&#xFF08;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#xFF09;&#x3092;&#x81EA;&#x52D5;&#x751F;&#x6210;&#x3057;&#x307E;&#x3059;&#x3002;  </li>
<li>&#x300C;Scenario&#xFF08;&#x30B7;&#x30CA;&#x30EA;&#x30AA;&#x30DE;&#x30C3;&#x30D7;&#xFF09;&#x300D;&#x30EC;&#x30A4;&#x30E4;&#x3067;&#x4EE5;&#x4E0B;&#x306E;&#x3053;&#x3068;&#x304C;&#x884C;&#x3048;&#x307E;&#x3059;&#x3002;  <ul>
<li>&#x5730;&#x5B66;&#x6559;&#x6750;&#x7528;&#x5730;&#x56F3;&#x306E;&#x4F5C;&#x6210;&#x306B;&#x5FC5;&#x8981;&#x306A;&#x30EC;&#x30A4;&#x30E4;&#x306E;&#x30BB;&#x30C3;&#x30C8;&#x3092;&#x81EA;&#x52D5;&#x4F5C;&#x6210;&#x3057;&#x307E;&#x3059;&#x3002;  </li>
<li>&#x5730;&#x56F3;&#x4E0A;&#x306E;&#x30EC;&#x30A4;&#x30E4;&#x306B;&#x4EFB;&#x610F;&#x306E;&#x30DD;&#x30A4;&#x30F3;&#x30C8;&#x3001;&#x30E9;&#x30A4;&#x30F3;&#x3001;&#x30DD;&#x30EA;&#x30B4;&#x30F3;&#x3092;&#x63CF;&#x753B;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;  </li>
<li>&#x89B3;&#x5BDF;&#x5730;&#x70B9;&#x3092;&#x307E;&#x3068;&#x3081;&#x305F;&#x30B3;&#x30F3;&#x30C6;&#x30F3;&#x30C4;&#x6587;&#x66F8;&#xFF08;HTML&#x3001;PDF&#x7B49;&#xFF09;&#x3092;&#x5730;&#x70B9;&#x30DE;&#x30FC;&#x30AB;&#x30FC;&#x3068;&#x3057;&#x3066;&#x5730;&#x56F3;&#x30DD;&#x30A4;&#x30F3;&#x30C8;&#x306B;&#x30DE;&#x30C3;&#x30D4;&#x30F3;&#x30B0;&#x3057;&#x3066;&#x30EA;&#x30F3;&#x30AF;&#x3092;&#x4F5C;&#x6210;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;  </li>
</ul>
</li>
<li>&#x300C;Subject&#xFF08;&#x4E3B;&#x984C;&#x56F3;&#xFF09;&#x300D;&#x30EC;&#x30A4;&#x30E4;&#x3067;&#x4EE5;&#x4E0B;&#x306E;&#x3053;&#x3068;&#x304C;&#x884C;&#x3048;&#x307E;&#x3059;&#x3002;  <ul>
<li>&#x30EB;&#x30FC;&#x30C8;&#x30DE;&#x30C3;&#x30D7;&#x3084;&#x5730;&#x8CEA;&#x56F3;&#x306E;&#x4F5C;&#x6210;&#x306B;&#x5FC5;&#x8981;&#x306A;&#x30EC;&#x30A4;&#x30E4;&#x306E;&#x30BB;&#x30C3;&#x30C8;&#x3092;&#x81EA;&#x52D5;&#x751F;&#x6210;&#x3057;&#x307E;&#x3059;&#x3002;  </li>
<li>&#x30C7;&#x30B8;&#x30BF;&#x30EB;&#x30AF;&#x30EA;&#x30CE;&#x30E1;&#x30FC;&#x30BF;&#x30FC;&#xFF08;GeoClino for iPhone&#xFF09;&#x3067;&#x51FA;&#x529B;&#x3057;&#x305F;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x30A4;&#x30F3;&#x30DD;&#x30FC;&#x30C8;&#x3057;&#x3066;&#x3001;&#x30EB;&#x30FC;&#x30C8;&#x30DE;&#x30C3;&#x30D7;&#x4E0A;&#x306B;&#x5C55;&#x958B;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;  </li>
<li>&#x8907;&#x6570;&#x306E;&#x30EB;&#x30FC;&#x30C8;&#x30DE;&#x30C3;&#x30D7;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x3066;&#x3001;&#x91CD;&#x306D;&#x3066;&#x8868;&#x793A;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;  </li>
<li>&#x4F5C;&#x6210;&#x3057;&#x305F;&#x30EB;&#x30FC;&#x30C8;&#x30DE;&#x30C3;&#x30D7;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x5730;&#x8CEA;&#x56F3;&#x306B;&#x30B3;&#x30D4;&#x30FC;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;  </li>
<li>&#x30EB;&#x30FC;&#x30C8;&#x30DE;&#x30C3;&#x30D7;&#x304A;&#x3088;&#x3073;&#x5730;&#x8CEA;&#x56F3;&#x306E;&#x4F5C;&#x6210;&#x30FB;&#x7DE8;&#x96C6;&#x6642;&#x306B;&#x3001;&#x8D70;&#x5411;&#x30FB;&#x50BE;&#x659C;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x3082;&#x3068;&#x306B;&#x88DC;&#x52A9;&#x8D70;&#x5411;&#x7DDA;&#x3092;&#x8868;&#x793A;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;  </li>
</ul>
</li>
<li>&#x4F5C;&#x6210;&#x3057;&#x305F;&#x5730;&#x56F3;&#x30C7;&#x30FC;&#x30BF;&#x306F;&#x3001;Web&#x5730;&#x5B66;&#x30E9;&#x30A4;&#x30D6;&#x30E9;&#x30EA;&#x306E;&#x30C7;&#x30FC;&#x30BF;&#x3068;&#x3057;&#x3066;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;  </li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 地学ライブラリツール 操作マニュアル">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chapter02.html" class="navigation navigation-next " aria-label="Next page: II. 地学ライブラリツールプラグインの導入・設定">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"I. はじめに","level":"1.1.1","depth":2,"next":{"title":"II. 地学ライブラリツールプラグインの導入・設定","level":"1.1.2","depth":2,"path":"chapter02.md","ref":"chapter02.md","articles":[]},"previous":{"title":"地学ライブラリツール 操作マニュアル","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[{"title":"I. はじめに","level":"1.1.1","depth":2,"path":"chapter01.md","ref":"chapter01.md","articles":[]},{"title":"II. 地学ライブラリツールプラグインの導入・設定","level":"1.1.2","depth":2,"path":"chapter02.md","ref":"chapter02.md","articles":[]},{"title":"III. オプションの設定","level":"1.1.3","depth":2,"path":"chapter03.md","ref":"chapter03.md","articles":[]},{"title":"IV. 地学ライブラリツールの機能","level":"1.1.4","depth":2,"path":"chapter04.md","ref":"chapter04.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["katex","-sharing","hide-published-with"],"pluginsConfig":{"katex":{},"hide-published-with":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter01.md","mtime":"2019-05-10T15:25:45.071Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-05-10T19:05:44.642Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-hide-published-with/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

